---
kind: event
id: E:Autodesk.Revit.UI.AddInCommandBinding.Executed
source: html/71c684fd-fc43-fadd-92f2-a7048c86d0fc.htm
---
# Autodesk.Revit.UI.AddInCommandBinding.Executed Event

Occurs when the command associated with this AddInCommandBinding executes.

## Syntax (C#)
```csharp
public event EventHandler<ExecutedEventArgs> Executed
```